UTAF_Base/requestFiles/BPS_SubscribedLine_ChangeAccount.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v3.subscribedline.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>BPS</urn:consumerApplicationId>
         <urn:endUserId>id058127</urn:endUserId>
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataChangeAccount version="3.2">
         <urn1:userContext>
            <urn2:applicationNm>BPS</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id058127</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:networkType>${Req_networkType}</urn1:networkType>
         <urn1:subscriptionNbr>${Req_subscriptionNbr}</urn1:subscriptionNbr>
         <urn1:contractId>${Req_contractId}</urn1:contractId>
         <urn1:subContractId>${Req_subContractId}</urn1:subContractId>
         <urn1:subscribedLineId>${Req_subscribedLineId}</urn1:subscribedLineId>
         <urn1:subscribedLineModTime>${Req_subscribedLineModTime}</urn1:subscribedLineModTime>
         <urn1:defaultBillingAccountId>${Req_defaultBillingAccountId}</urn1:defaultBillingAccountId>
         <urn1:trafficBillingAccountId>${Req_trafficBillingAccountId}</urn1:trafficBillingAccountId>
         <urn1:partyId>${Req_partyId}</urn1:partyId>
         <urn1:defaultPaymentAgreementId>${Req_defaultPaymentAgreementId}</urn1:defaultPaymentAgreementId>
         <urn1:trafficPaymentAgreementId>${Req_trafficPaymentAgreementId}</urn1:trafficPaymentAgreementId>
      </urn1:RequestDataChangeAccount>
   </soapenv:Body>
</soapenv:Envelope>